Move from PlantUML to mermaid (#1)
* Convert one diagram into mermaid.

* Convert remaining diagrams to mermaid.

* Fix fences annotations.

Co-authored-by: Luca Palmieri <rust@lpalmieri.com>
